In [45]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import pickle

%matplotlib inline
from sklearn.linear_model import LinearRegression

In [3]:
df = pd.read_csv("C:/Users/Dickson/Downloads/Data Science tutorials/hiring.csv")
df

,experience,test_score(out of 10),interview_score(out of 10),salary($),Unnamed: 4,Unnamed: 5
0,NaN,8.0,9,50000,NaN,NaN
1,NaN,8.0,6,45000,NaN,NaN
2,five,6.0,7,60000,NaN,NaN
3,two,10.0,10,65000,NaN,NaN
4,seven,9.0,6,70000,NaN,NaN
5,three,7.0,10,62000,NaN,
6,ten,NaN,7,72000,NaN,NaN
7,eleven,7.0,8,80000,NaN,NaN

In [10]:
#df.drop(['Unnamed: 4','Unnamed: 5'], axis= 'columns', inplace=True)
#df.head()

In [13]:
#fill the missing values
df['experience'].fillna(0, inplace = True)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0                    8.0                           9      50000
1          0                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [15]:
df['test_score(out of 10)'].fillna(df['test_score(out of 10)'].mean(), inplace = True)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0               8.000000                           9      50000
1          0               8.000000                           6      45000
2       five               6.000000                           7      60000
3        two              10.000000                          10      65000
4      seven               9.000000                           6      70000
5      three               7.000000                          10      62000
6        ten               7.857143                           7      72000
7     eleven               7.000000                           8      80000

In [35]:
X = df.iloc[:, :3]

In [39]:
#convert experience column to integer
def convert_to_int(word):
    word_dict = {'one':1,'two':2,'three':3,'four':4,'five':5,'six':6,'seven':7,'eight':8,'nine':9,'ten':10,'eleven':11,
                 'twelve':12, 'zero':0,0:0}
    return word_dict[word]

In [42]:
X['experience'] = X['experience'].apply(lambda x: convert_to_int(x))

In [43]:
y = df.iloc[:, -1]

In [46]:
model = LinearRegression()
model.fit(X,y)

LinearRegression()

In [51]:
model.score(X,y)

0.9639958361860578

In [53]:
#save the model
pickle.dump(model, open('hiring.pkl', 'wb'))
model = pickle.load(open('hiring.pkl', 'rb'))